InformationRegisters/НастройкаКонтроляОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкаКонтроляОбеспечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контролировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаКонтроляОбеспечения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает настройку контроля обеспечения склада
//
//	Параметры:
//		Склад - СправочникСсылка.Склады - склад, для которого необходимо получить настройку контроля обеспечения
//	Возвращаемое значение:
//		Булево - настройка контроля обеспечения склада. Неопределено, если настройка отсутствует.
//
Функция НастройкаСклада(Склад) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Настройка.Контролировать КАК Контролировать
	|ИЗ
	|	РегистрСведений.НастройкаКонтроляОбеспечения КАК Настройка
	|ГДЕ
	|	Настройка.Склад = &Склад
	|	И Настройка.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И Настройка.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)");

	Запрос.УстановитьПараметр("Склад", Склад);

	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Контролировать;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Сохраняет настройку контроля обеспечения склада
//
//	Параметры:
//		Склад - СправочникСсылка.Склады - склад, для которого необходимо сохранить настройку контроля обеспечения
//		Контролировать - Булево - необходимость контроля обеспечения по складу, сохраняемое значение.
//
Процедура УстановитьНастройку(Склад, Контролировать) Экспорт

	НастройкаКонтроляОбеспечения = НастройкаСклада(Склад);

	Если НастройкаКонтроляОбеспечения <> Контролировать Тогда

		МенеджерЗаписи = РегистрыСведений.НастройкаКонтроляОбеспечения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Склад = Склад;
		МенеджерЗаписи.Контролировать = Контролировать;

		МенеджерЗаписи.Записать();

	КонецЕсли;

КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Склад)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти


#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ОписаниеОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.5.4.400";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.НастройкаКонтроляОбеспечения.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.НастройкаКонтроляОбеспечения.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.НастройкаКонтроляОбеспечения";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.НастройкаКонтроляОбеспечения";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru='Обновляет записи в регистре ""Настройка контроля обеспечения"". Удаляет некорректные записи, содержащие группы номенклатуры.';uk='Оновлює записи в регістрі ""Настройка контролю постачання"". Видаляє неправильні записи, що містять групи номенклатури.'");
	
КонецПроцедуры

Функция ПолноеИмяРегистра()
	
	Возврат "РегистрСведений.НастройкаКонтроляОбеспечения";
	
КонецФункции

// Регистрация данных к обработке при обновлении ИБ.
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра();
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	НастройкаКонтроляОбеспечения.Склад          КАК Склад,
		|	НастройкаКонтроляОбеспечения.Номенклатура   КАК Номенклатура,
		|	НастройкаКонтроляОбеспечения.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.НастройкаКонтроляОбеспечения КАК НастройкаКонтроляОбеспечения
		|ГДЕ
		|	НастройкаКонтроляОбеспечения.Номенклатура.ЭтоГруппа";
	Запрос = Новый Запрос(ТекстЗапроса);
	
	КлючиЗаписей = Запрос.Выполнить().Выгрузить();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, КлючиЗаписей, ДополнительныеПараметры);
	
КонецПроцедуры

// Обработка данных при обновлении ИБ.
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкаКонтроляОбеспечения.СоздатьНаборЗаписей();
	
	ДанныеКОбработке = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь,
		ПолноеИмяРегистра());
	
	Пока ДанныеКОбработке.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра());
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Склад",          ДанныеКОбработке.Склад);
			ЭлементБлокировки.УстановитьЗначение("Номенклатура",   ДанныеКОбработке.Номенклатура);
			ЭлементБлокировки.УстановитьЗначение("Характеристика", ДанныеКОбработке.Характеристика);
			
			Блокировка.Заблокировать();
			
		Исключение
			
			ЗафиксироватьТранзакцию();
			Продолжить;
			
		КонецПопытки;
		
		Попытка
			
			НаборЗаписей.Отбор.Склад.Установить(ДанныеКОбработке.Склад);
			НаборЗаписей.Отбор.Номенклатура.Установить(ДанныеКОбработке.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(ДанныеКОбработке.Характеристика);
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
		
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru='Не удалось записать данные в регистр %ИмяРегистра% по причине: %Причина%';uk='Не вдалося записати дані в регістр %ИмяРегистра% через: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяРегистра%", ПолноеИмяРегистра());
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.НастройкаКонтроляОбеспечения,
				Неопределено,
				ТекстСообщения);
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра());
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#КонецЕсли
